function compute_χ_r(ρ¹², 𝐒¹², 𝐏)
   Pᵢ, Pⱼ, Pₖ = 𝐏
   Sᵢ¹², Sⱼ¹², Sₖ¹² = 𝐒¹²

   Sⱼ¹²Sₖ¹² = Sⱼ¹² *ᵣ Sₖ¹²
   Sₖ¹²Sᵢ¹² = Sₖ¹² *ᵣ Sᵢ¹²
   Sᵢ¹²Sⱼ¹² = Sᵢ¹² *ᵣ Sⱼ¹²

   ρ¹²Sᵢ¹² = ρ¹² *ᵣ Sᵢ¹²
   ρ¹²Sⱼ¹² = ρ¹² *ᵣ Sⱼ¹²
   ρ¹²Sₖ¹² = ρ¹² *ᵣ Sₖ¹²

   χᵢ⁺ = (Sⱼ¹²Sₖ¹² +ᵣ ρ¹²Sᵢ¹²) *ᵣ Pᵢ
   χᵢ⁻ = (Sⱼ¹²Sₖ¹² -ᵣ ρ¹²Sᵢ¹²) *ᵣ Pᵢ

   χⱼ⁺ = (Sₖ¹²Sᵢ¹² +ᵣ ρ¹²Sⱼ¹²) *ᵣ Pⱼ
   χⱼ⁻ = (Sₖ¹²Sᵢ¹² -ᵣ ρ¹²Sⱼ¹²) *ᵣ Pⱼ

   χₖ⁺ = (Sᵢ¹²Sⱼ¹² +ᵣ ρ¹²Sₖ¹²) *ᵣ Pₖ
   χₖ⁻ = (Sᵢ¹²Sⱼ¹² -ᵣ ρ¹²Sₖ¹²) *ᵣ Pₖ

   return (χᵢ⁺, χᵢ⁻, χⱼ⁺, χⱼ⁻, χₖ⁺, χₖ⁻)
end

function compute_B_r(𝛘)
   χᵢ⁺, χᵢ⁻, χⱼ⁺, χⱼ⁻, χₖ⁺, χₖ⁻ = 𝛘

   𝛘′ = ((χᵢ⁺, χᵢ⁻), (χⱼ⁺, χⱼ⁻), (χₖ⁺, χₖ⁻))

   Dᵢ, Dⱼ, Dₖ = ( inv_r(1.0 -ᵣ (χ⁻ *ᵣ χ⁺))  for (χ⁺, χ⁻) in 𝛘′)

   Bᵢᵏ = (χₖ⁻ -ᵣ (χⱼ⁺ *ᵣ χᵢ⁺)) *ᵣ Dᵢ
   Bᵢʲ = (χⱼ⁺ -ᵣ (χₖ⁻ *ᵣ χᵢ⁻)) *ᵣ Dᵢ

   Bⱼⁱ = (χᵢ⁻ -ᵣ (χₖ⁺ *ᵣ χⱼ⁺)) *ᵣ Dⱼ
   Bⱼᵏ = (χₖ⁺ -ᵣ (χᵢ⁻ *ᵣ χⱼ⁻)) *ᵣ Dⱼ

   Bₖʲ = (χⱼ⁻ -ᵣ (χᵢ⁺ *ᵣ χₖ⁺)) *ᵣ Dₖ
   Bₖⁱ = (χᵢ⁺ -ᵣ (χⱼ⁻ *ᵣ χₖ⁻)) *ᵣ Dₖ

   return (Bᵢᵏ, Bᵢʲ, Bⱼⁱ, Bⱼᵏ, Bₖʲ, Bₖⁱ)
end


function compute_𝐉̂_r(ρ¹², 𝐒¹², 𝐏)
   Pᵢ, Pⱼ, Pₖ = 𝐏
   Sᵢ¹², Sⱼ¹², Sₖ¹² = 𝐒¹²
   ∇Sᵢ¹², ∇Sⱼ¹², ∇Sₖ¹² = map(∇ᵣ, 𝐒¹²)
   ∇²Sᵢ¹², ∇²Sⱼ¹², ∇²Sₖ¹² = map(Δᵣ, 𝐒¹²)
   ∇²ρ¹² = Δᵣ(ρ¹²)
   
   𝐉̂ᵢ = ((ρ¹² *ᵣ ∇²Sᵢ¹²) -ᵣ (Sᵢ¹² *ᵣ ∇²ρ¹²) +ᵣ (Sⱼ¹² *ᵣ ∇²Sₖ¹²) +ᵣ (∇Sⱼ¹² ⋅ᵣ ∇Sₖ¹²) -ᵣ (Sₖ¹² *ᵣ ∇²Sₖ¹²) -ᵣ (∇Sₖ¹² ⋅ᵣ ∇Sₖ¹²)) *ᵣ Pᵢ
   𝐉̂ⱼ = ((ρ¹² *ᵣ ∇²Sⱼ¹²) -ᵣ (Sⱼ¹² *ᵣ ∇²ρ¹²) +ᵣ (Sₖ¹² *ᵣ ∇²Sᵢ¹²) +ᵣ (∇Sₖ¹² ⋅ᵣ ∇Sᵢ¹²) -ᵣ (Sᵢ¹² *ᵣ ∇²Sᵢ¹²) -ᵣ (∇Sᵢ¹² ⋅ᵣ ∇Sᵢ¹²)) *ᵣ Pⱼ
   𝐉̂ₖ = ((ρ¹² *ᵣ ∇²Sₖ¹²) -ᵣ (Sₖ¹² *ᵣ ∇²ρ¹²) +ᵣ (Sᵢ¹² *ᵣ ∇²Sⱼ¹²) +ᵣ (∇Sᵢ¹² ⋅ᵣ ∇Sⱼ¹²) -ᵣ (Sⱼ¹² *ᵣ ∇²Sⱼ¹²) -ᵣ (∇Sⱼ¹² ⋅ᵣ ∇Sⱼ¹²)) *ᵣ Pₖ

   return (𝐉̂ᵢ, 𝐉̂ⱼ, 𝐉̂ₖ)
end

function compute_bivector_r(ρ¹², 𝐒¹²)
   ρ, Sᵢ, Sⱼ, Sₖ = map((d¹²) -> d¹² * d¹², (ρ¹², 𝐒¹²...))
   S = Sᵢ + Sⱼ + Sₖ

   𝐏 = map((Sₖ′) -> inv_r((ρ-S)/2.0 + Sₖ), (Sᵢ, Sⱼ, Sₖ))
   𝛘 = compute_χ_r(ρ¹², 𝐒¹², 𝐏)
   𝐁 = compute_B_r(𝛘)
   𝐉̂ = compute_𝐉̂_r(ρ¹², 𝐒¹², 𝐏)

   χᵢ⁺, χᵢ⁻, χⱼ⁺, χⱼ⁻, χₖ⁺, χₖ⁻ = 𝛘
   Bᵢᵏ, Bᵢʲ, Bⱼⁱ, Bⱼᵏ, Bₖʲ, Bₖⁱ = 𝐁
   𝐉̂ᵢ, 𝐉̂ⱼ, 𝐉̂ₖ = 𝐉̂

   vᵢ = 0.25 *ᵣ (𝐉̂ᵢ -ᵣ (Bᵢᵏ *ᵣ 𝐉̂ⱼ) -ᵣ (Bᵢʲ *ᵣ 𝐉̂ₖ)) *ᵣ inv_r(1.0 -ᵣ (Bᵢᵏ *ᵣ χⱼ⁺) -ᵣ (Bᵢʲ *ᵣ χₖ⁻))
   vⱼ = 0.25 *ᵣ (𝐉̂ⱼ -ᵣ (Bⱼⁱ *ᵣ 𝐉̂ₖ) -ᵣ (Bⱼᵏ *ᵣ 𝐉̂ᵢ)) *ᵣ inv_r(1.0 -ᵣ (Bⱼⁱ *ᵣ χₖ⁺) -ᵣ (Bⱼᵏ *ᵣ χᵢ⁻))
   vₖ = 0.25 *ᵣ (𝐉̂ₖ -ᵣ (Bₖʲ *ᵣ 𝐉̂ᵢ) -ᵣ (Bₖⁱ *ᵣ 𝐉̂ⱼ)) *ᵣ inv_r(1.0 -ᵣ (Bₖʲ *ᵣ χᵢ⁺) -ᵣ (Bₖⁱ *ᵣ χⱼ⁻))
   
   return (vᵢ, vⱼ, vₖ)
end